Revit 2026 API

# FilledRegionTypeIsValidForegroundPatternId Method

---

Check if the id is valid for a foreground pattern

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidForegroundPatternId(
	ElementId patternId
)
```
```vb
Public Function IsValidForegroundPatternId (
	patternId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidForegroundPatternId(
	ElementId^ patternId
)
```
```fsharp
member IsValidForegroundPatternId :
        patternId : ElementId -> bool
```

#### Parameters

patternId ElementId
     Element id of the FillPatternElement

#### Return Value

Boolean False if in a family, and the id is a FillPatternElement that targets 'Drafting'. True otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

In a family the FillPatternElement must be a 'Drafting' pattern.

#### Reference

FilledRegionType Class

Autodesk.Revit.DB Namespace